<a href="https://colab.research.google.com/github/tbazzi/Data-Science---Fullstack-Bootcamp/blob/master/S9_1_Azure_Interagir_avec_les_bases_de_donne%CC%81es.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Imports

In [0]:
import pandas as pd
import sqlalchemy
import psycopg2

# Creér la connexion

In [0]:
# Update connection string information obtained from the portal


dbname='postgres' 
user='admintb@postgretb' 
host='postgretb.postgres.database.azure.com'
password='***' 
port='5432' 
sslmode='require'

# Construct connection string
conn_string = "host={0} user={1} dbname={2} password={3} sslmode={4}".format(host, user, dbname, password, sslmode)

conn = psycopg2.connect(conn_string) 

#------------------------------------------

In [31]:
data = [
    {"Col1": 1, "Col2": "A"},
    {"Col1": 2, "Col2": "B"},
    {"Col1": 3, "Col2": "C"}
]

df_test = pd.DataFrame(data)
df_test

   Col1 Col2
0     1    A
1     2    B
2     3    C

In [35]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [45]:
df = pd.read_csv("/content/drive/My Drive/train_titanic.csv")
df.columns  = [x.lower() for x in df.columns]
df.head()

   passengerid  survived  pclass  ...     fare cabin  embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

# Charger des données

In [39]:
connexion_string = "postgresql://{0}:{1}@{2}/{3}".format(user, password, host, dbname)
engine = sqlalchemy.create_engine(connexion_string)
engine.connect()

In [0]:
df_test.to_sql("table_1", engine, index=False, if_exists="replace")

In [0]:
df.to_sql("titanic", engine, index=False, if_exists="replace")

# Récupérer des données

In [34]:
df_test = pd.read_sql("SELECT * FROM table_1", engine)
df_test

   Col1 Col2
0     1    A
1     2    B
2     3    C

In [49]:
query = pd.read_sql("SELECT sex, age, count(*) FROM titanic where titanic.survived = 1 group by sex, age", engine)
query

        sex    age  count
0    female  27.00      5
1      male   8.00      1
2      male   0.92      1
3    female  43.00      1
4      male  27.00      6
..      ...    ...    ...
101  female  63.00      2
102  female  49.00      2
103  female   6.00      1
104    male  31.00      3
105    male  48.00      3

[106 rows x 3 columns]

# Ressources

In [0]:
print("Doc Microsoft pour Azure Postgres : ")

print("https://docs.microsoft.com/fr-fr/azure/postgresql/quickstart-create-server-database-portal")

Doc Microsoft pour Azure Postgres :
https://docs.microsoft.com/fr-fr/azure/postgresql/quickstart-create-server-database-portal

In [0]:
print("Commande de connexion depuis la console Azure : ")

print("psql --host=bddserverstudent.postgres.database.azure.com --port=5432 --username=jedha@bddserverstudent --dbname=postgres")

Commande de connexion depuis la console :
psql --host=bddserverstudent.postgres.database.azure.com --port=5432 --username=jedha@bddserverstudent --dbname=postgres

In [0]:
psql --host=bddserverstudent.postgres.database.azure.com --port=5432 --username=admission@bddserverstudent --dbname=postgres